# 1.
# names = ['jun', 'alex', 'ken'] 일 때,
#
# 0번째 손님 : jun
# 1번째 손님 : alex
# 2번째 손님 : ken
# 을 출력하시오. 단, for, while을 활용하여 2번 작성하시오.

# 2.
# 구구단 3단을 출력하시오. 단, for, while을 활용하여 다양하게 만들어보시오.

# 2.a
# 40 이하의 3의 배수를 출력하시오(3단의 확장). 반복의 종류는 자유롭게 사용하시오.

# 3.
# 1 ~ 100 중에 7의 배수의 개수를 출력하세요.

# 4.
# lst = [1,2,3,4,5,6,7] 일 때,
# 원소가  1, 4, 5, 7인 경우를 제외하고 출력하세요

# 4.
# 1 ~ 9 까지의 자연수 중 제곱한 수가 10 이상 50 이하인 자연수의 리스트를 출력해보세요.

# 5.
# n = 17일 때, n이 소수인지 판단하시오. (추가로, n을 입력받아 같은 과정을 반복하시오.)




# plus
# 자판기 제작
#
# 환타 / 1000원 / 재고 1개
# 사이다 / 1500원 / 재고 3개
# 콜라 / 2000원 / 재고 5개
# 의 데이터를 가지고
# 다음과 같은 서비스를 만드시오
#
# 1. 돈을 입력받습니다.
# 2. 상품의 이름을 입력 받습니다.
# 3. 구매 가능하다면, 구매합니다.
# 4. 구매 가능하지 않다면, 구매하지 않습니다.
# 5. 2 ~ 4의 과정을 반복합니다. 돈이 부족해 구매가 불가능하다면, 반복을 멈춥니다.
# 6. 구매한 상품과 개수를 출력합니다.
#
# + 위 과정 중에서 추가적인 정보가 필요하다면 print하여 보여줍니다.(예, 물품의 재고 및 가격 등)
#
